{"definitions": [
    {
        "ArabicWord": "بِسْمِ",
        "AyatId": 1,
        "Comments": "ب (حرف) -  س م و",
        "Eng_Lugat": "B ب (حرف)\\n\\nThe following examples will make the use of this letter clear:\\n\\n اَمْسَکْتُ بِزَیْدٍ  (amsaktu bi zaid): I caught Zaid\\n مَرَرْتُ بِزَیْدٍ  (marartu bi zaid): I went past Zaid\\n ذَهَبَ زَیْدٌ  (zahaba zaid): Zaid went\\n ذَهَبْتُ بِزَیْدٍ  (zahabtu bi zaid): I went with Zaid, or I took Zaid with me.\\n\\nThe Quran says: \\n4:43 do the  masah  on your faces  (wipe one_s hands over the face without water, while performing ablution).  فَامْسَحُواْ بِوُجُوهِكُمْ\\n25:72 When they walk past by fault. اِذَا مَرُّوْا بِاللَّغْوِ\\n2:17 Allah deprived them of their light ذَهَبَ اللّهُ بِنُورِهِمْ\\n2:54 You have been unkind to yourself due to worshipping a calf. ظَلَمْتُمْ اَنْفُسَکُمْ بِاتِخَاذِکُمْ\\n11:48 Nooh, dismount with safety نُوحُ اهْبِطْ بِسَلاَمٍ مِّنَّا\\n96:4 he taught with (through) the pen عَلَّمَ بِالْقَلَمِ\\n\\nTo indicate time or place, meaning  in : \\n54:34 We saved them in the morning نَّجَّيْنَاهُم بِسَحَرٍ\\n3:123 truly Allah has helped you in the field of Badr وَلَقَدْ نَصَرَكُمُ اللّهُ بِبَدْرٍ\\n\\nIn exchange for something, as in: \\n12:20 And they sold him (Yusuf) in exchange for a small price. وَشَرَوْهُ بِثَمَنٍ بَخْسٍ\\n\\nTo mean  عَلٰی  (a_la) or  over , the Quran says:\\n4:42 If the earth could be levelled over them. لَوْتُسَوَّیٰ بِهِمُ الْاَرْضُ\\n\\nTo mean  from , as in:\\n25:59 About him, inquire from someone who knows فَاسْأَلْ بِهِ خَبِيرًا\\n76:6 the stream from which servants of Allah drink عَیْنًّا یَشْرَبُ بِهَاعِبَادُ اﷲِ\\n\\nSome think that the way  مِنْ  (min) is used here, means  some . Not full, but a part. As such, some people maintain that the following verse should be translated as shown below: \\n5:6 Do the  masaah  over a part of the head   وَامْسَحُوْا بِرُءُ وْسِکُمْ\\n\\nAt some places this letter is additional and doesn_t mean anything, as in:\\n13:43 Allah is witness enough کَفٰی بِاﷲِ شَهِیْداً\\n\\nEven if  beh  had not been used in the above verse, it would generate the same meaning.\\n\\nMirza Abul Fazal writes in his book Gharib-ul-Quran that the  beh  in  بِسْمِ اﷲِ  (bismillah) is to invoke help.\\n\\n  بِاﷲِ  (billah): to swear on Allah. This means that  beh  is also used to swear. \\n\\nS-M-W  س م و\\n\\n سَمَاءٌ  (sama-a), with plural form  سَمٰوٰتٌ  (samawaat) means sky because it is high and overshadows the earth. It actually means anything that is over you and overshadows you. \\n\\n سَمَاءٌ  (sama-a): every roof over your head. Fuqah-ul-lugha has also said that this word has this meaning: \\n\\nRaghib says that everything is  سَمَاءٌ  (sama-a) in relation to a thing below it, and everything in relation to the thing above is called  اَرْضٌ  (arz). \\n\\nClouds and rain as well are called  سَمَاءٌ  (sama-a). Greenery and plants are called  سَمَاءٌ  (sama-a) as well because they are higher than the earth {T}, {Ibn Qateebah}.\\n\\n اِسْمٌ  (ism) means a sign with which one recognizes something. \\nNames are also called  اِسْمٌ  (ism). Plural is  اَسْمَاءٌ  (asma-a). \\n سَمِیٌّ  (sammi) means of a similar name and equal. \\n مُسَامَاۃٌ  (musaamah) means mutual respect {T}. \\n سَمَّی تَسْمِیَۃً  (samma tasmeeh): to keep a name, to name something. \\n اَلْمُسَمّٰی  (al-musamma): name that is kept or given, said to be, nominated, designated, fixed and known {T}.\\n\\nMufardaat says:\\n until the  musamma  is known, names are of no use مَعْرِفَةُ الْاَسْمَاءِ لَاتحْصُلُ اِلَّا بِمَعْرِفَةِ الْمُسَمّٰی\\n\\nIt means that Adam (human beings) has been given the ability to recognize things by their constituents and can characterise these by their properties and can identify them accordingly by giving them different names. \\n\\nThe Quran has used  اَرْضٌ وَسَمَاءٌ  (arz o sama-a) at many places. There is no doubt that this earth of ours is also called  اَرْضٌ  (arz) i.e. Earth, but everything in relation to (Sama) heavens seen as above is called  اَرْضٌ  (arz) as well. Therefore  اَرْضٌ وَسَمَاءٌ  (arz o sama-a) would mean the lows and highs of the universe as visible to us. When  اَرْضٌ  (arz) is to be used against  سَمَاءٌ  (sama-a) then  سَمَاءٌ  (sama-a) would also include the entire universe, and  اَرْضٌ  (arz) would refer to the society and civilization of humans. Therefore,  سَمَاءٌ  (sama-a) or  سَمٰوٰتٌ  (samawat) would not only mean sky and heavens, but also everything that is in the universe which includes galaxies so far discovered and those yet to be discovered and beyond. In other words, this word includes everything there is to be found. \\n\\nWhere ever the Quran has used the phrase of  اَرْضٌ وَسَمَاءٌ  (arz o sama-a), it needs to seen in the context in which it appears e.g. whether it implies loftiness and lowliness, whether it is in regard to physical things or in respect of ranks, or social life within a society. More details have appeared under the heading (A-R-Zd).\\n\\nThe Quran says:\\n2:31 Adam has been taught the names of everything وَعَلَّمَ آدَمَ الْاَسْمَاءَ کُلَّهَا\\n\\nHere Adam refers to all humanity or mankind. Also see under the heading (A-D-M). As mentioned earlier, knowing the names alone will do no good, until and unless you know what a thing is. As such, the meaning of the knowledge of names being given to Adam or man means that he has been given the potential and ability to discover and determine the characteristics of various elements and things in the universe. This is the reason the Quran declares that all the forces of the universe (the Malaikah) are within the reach and control of the man i.e. he has the potentials, attributes, and abilities to bring these to his use. The Quran does not differentiate this life from the next life when mentions these aspects of putting to the disposal of the human potentials. When man becomes aware of the law under which these forces of nature operate, all forces under that law become within his reach and are acchiveable. The Quran refers to both parts of human life i.e. this physical existence and the life beuond death. It is upto us to explore both possibilities through the use of our intellect and reasoning. Therefore, a nation will become master of the universal forces according to the laws it becomes aware of. Further step is how to utilize those forces. \\n\\nIt has been said: \\n2:38 Any nation which will utilize the guidance in the Quran they will have no fear and no grief.  فَمَنْ تَبِعَ هُدَایَ فَلَاخَوْفٌ عَلِیْهِمْ وَلَاهُمْ یَحْزَنُوْنَ\\n2:39 If a nation which masters the forces of the universe but utilizes these not for the benefit of the mankind then they will suffer the consequences of going agains the Quranic guidance.  اُولٰئِکَ اَصْحٰبُ النَّارِ هُمْ فِیْهَا خَالِدُوْنَ\\n\\nWhat should be nation called then it neither masters the forces of the universe nor utilizes these forces as per the laws of God? A western doctor has written something very interesting as per his perception. \\n\\n Adam was made responsible for characterising things. This was a very husge responsibility, because the things whose characteristics and properties are not known remain undetermined and undefined. And if inaccurate characteriscis are given to things, the results can be very harmful . {Dr. M.L. Tyler in  Homeo, drug pictures  (preface)}.\\n\\n\\nThis too signifies that acquiring knowledge about physical laws is a sign of being human. The Quran says that those whom you think are your gods (other than the real God) are: \\n12:40 Simply some names which you and your forefathers have fabricated اَسْمَاءٌ سَمَّیتُمُوْهَا اَنْتُمْ وَآبَاؤُ کُمْ\\n12:40 Allah has not provided any support for this (not evidence and fact based) مَا اَنْزَلَ اللّٰهُ بِهَا مِنْ سُلْطَانٍ \\n\\nThe big religious structures which have been erected from the past or those being erected now have no real significance other than the names given to them. These don_t solve any human problems and issues except being used to project some mortals in high position to impress fellow mortals to influence them. The Quranic guidance explains the purpose of each human and thus takes away all the paraphernalia associated with the power, religious stature or wealth and helps us to look through to the reality. The right place of things is that which has been designated by Allah_s law. His laws operate smoothly in the outer universe, and in the human world, the divine revelation is the right source and guide to these laws. Everything else may have a big name but gets exposed when analysed in the light of the guidance provided in the Quran. \\n",
        "Id": 2,
        "Letter": "B+S-M-W ",
        "Lugat": "سَمَاءٌ  ۔ (جمع سَمٰوٰتٌ ) آسمان کوکہتے ہیں کیونکہ وہ زمین پر بلند اور سایہ فگن ہوتا ہے۔ نیز ہر اس چیز کو جو تمہارے اوپر چھائی ہوئی اور سایہ فگن ہو،  سَمَاءٌ کہیں گے۔ چنانچہ گھر کی ہر چھت بھی سَمَاءٌ کہلاتی ہے۔ فقة اللغة میں بھی سَمَاءٌ  کی  یہی تعریف کی گئی ہے۔ راغب نے کہا ہے کہ ہر چیز اپنے سے نچلی چیز کی نسبت سے سَمَاءٌ   کہلاتی ہے اور اپنے سے اوپر کی چیز کی نسبت سے اَرْضٌ ۔ نیز بادل اور بارش کو بھی سَمَاءٌ کہتے ہیں۔ پودے اور سبزے کو بھی سَمَاءٌ کہتے ہیں کیونکہ وہ زمین سے اونچا ہوتا ہے***(تاج نیز ابن قتیبہ۔ القرطین ج / 2 صفحہ 28)۔\\r\\n اِسْمٌ کے معنی ہیں کسی چیز کی علامت جس سے اسے پہچانا جائے۔ پھر نام کو بھی  اِسْمٌ  کہتے ہیں، اس کی جمع  اَ سْمَاءٌ ہے۔ اس کا مادہ بھی س ۔ م  ۔و ۔ ہے۔ اس جہت سے کہ اسم سے مسمی پہچانا جاتا ہے اور اسی سے اسے بلندی و عزت حاصل ہوئی ہے۔ سَمِیٌّ کے معنی ہمنام اور نظیر و ہم پلہ کے آتے ہیں۔ مُسَامَاۃٌ کے معنی باہمی مفاخرت کے آتے ہیں*(تاج)۔ سَمَّی تَسْمِیةً ۔نام رکھنا۔ اَ لْمُسَمّٰی کے معنی نام رکھا ہوا، بتایا ہوا، نامزد کیا ہوا۔ نیز معین ، مقرر اور معلوم*(تاج)۔\\r\\n صاحب مفردات نے عَلَّمَ آدَمَ الْاَسْمَاءَ پر بحث کرتے ہوئے لکھا ہے کہ مَعْرِفَۃُ الْاَسْمَاءِ لَاتحْصُلُ اِلَّا بِمَعْرِفةِ الْمُسَمّٰی۔ جب تک مسمّٰی کا علم نہ ہو اس کے  اَ سْمَاء   کا تعارف کچھ فائدہ نہیں دیتا***(راغب)۔ اس کا مطلب یہ ہے کہ آدم کو علم اشیاء کی ایسی صلاحیت دی گئی ہے کہ وہ ہر چیز کو اس کی شکل اور اس کے خواص سے معلوم کر کے اس کو پہچاننے کے لیے نام رکھتا ہے۔\\r\\n قرآن کریم میں اَ رْضٌ وَسَمَاءٌ بے شمار مقامات میں آتا ہے۔ اس میں شبہ نہیں کہ ہماری اس زمین کو بھی، جس پر ہم رہتے ہیں،  اَ رْضٌ کہتے ہیں۔ لیکن چونکہ ہر بلندی کو (پستی کی نسبت سے) سَمَاءٌ اور ہر پستی کو (اس کی بلندی کی نسبت سے) اَ رْضٌ کہتے ہیں، اس لیے اَرْضٌ وَسَمَاءٌ کے معنے کائنات کی پستیاں اور بلندیاں ہونگے۔اور جب اَرْضٌ وَسَمَاءٌ کے مقابل میں لایا جائے گا تو   سَمَاءٌ سے مفہوم کائناتی زندگی اور اس کا نظام بھی ہوگا، اور اَرْضٌ سے مراد انسان کی معاشرتی، معاشی اور تمدنی زندگی۔ نیز سَمَاءٌ یا سَمٰوٰتٌ سے مراد محض اجرام ِفلکی ہی نہیں ہوں گے بلکہ فضا کی بلندیوں میں پھیلی ہوئی تمام توانائیاں مثل ایتھر اور ایٹم وغیرہ بھی ہوں گے۔ یعنی فضا مع اپنے مشمولات کے۔\\r\\n قرآن کریم میں جہاں جہاں اَ رْضٌ وَسَمَاءٌ کے الفاظ آئے ہیں سیاق و سباق پر غور کرنے سے بآسانی سمجھ میں آجائے گا کہ اُس جگہ سَمَاءٌ میں بلندی کا پہلو ہے اور اَ رْضٌ میں پستی کا۔ خواہ وہ محسوس اشیاء میں ہو۔ خواہ منصب اور مرتبہ کے لحاظ سے اور خواہ کائناتی قوانین کے مقابلہ میں انسان کی معاشرتی زندگی ہو جسے اس نے اپنی مفاد پرستیوں کے سانچے میں ڈھال رکھا ہے۔ (مزید بحث ارض کے عنوان کے تحت آچکی ہے)۔\\r\\n قرآن کریم میں ہے کہ  وَعَلَّمَ اٰدَمَ الْاَسْمَاۗءَ كُلَّهَا [2: 31]۔ آدم کو تمام اشیاء کے اَسْمَاء سکھا دئے گئے۔ آدم سے مراد خود آدمی ہے۔ یعنی انسان (دیکھئے عنوان ا ۔ د ۔ م) جیسا کہ اوپر لکھا جاچکا ہے، اسماء کا جاننا کچھ فائدہ نہیں دے سکتا جب تک آپ کو مسمّٰی (جس چیز کا وہ نام ہے)اس کا علم نہ ہو۔ لہٰذا آدم کو جو علم الاسماء دیا گیا تو اس کے معنی یہ ہیں کہ انسان میں اشیائے کائنات کے متعلق معلومات حاصل کرنے کی استعدادرکھ دی گئی ہے، اس کا نتیجہ یہ ہے کہ ملائکہ (کائنات میں کام کرنے والی قوتیں) اس کے سامنے سر بسجود ہیں۔ جب انسان اس قانون سے واقف ہو جاتا ہے جو کائنات میں کارفرما ہے تو جو جو قوتیں اس قانون کے مطابق کام کر رہی ہیں وہ سب اس کے تابع فرمان ہو جاتی ہیں۔ لہٰذا جس قدر کوئی قوم اشیائے فطرت کے متعلق معلومات بہم پہنچا کر انہیں اپنے تابع فرمان کر لے گی اسی قدر وہ مسجود ملائکہ بنتی جائے گی۔ اس سے اگلا مرحلہ یہ ہے کہ ان قوتوں کا استعمال کس طرح کیا جائے۔ سو اس کے متعلق فرمادیا کہ فَمَنْ تَبِعَ ھُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا ھُمْ يَحْزَنُوْنَ [2: 38]۔ جو قوم وحی خداوندی کا اتباع کرے گی اسے کوئی خوف و حزن نہیں ہو گا۔ اور جو قوم انہیں اپنی مرضی کے مطابق (اپنی مفاد پرستیوں کے لیے) صرف کرے گی وہ خود بھی ہلاکتوں میں پڑے گی اور دوسروں کے لیے بھی باعث مصیبت بن جائے گی۔  اُولٰۗىِٕكَ اَصْحٰبُ النَّارِ   ۚ   ھُمْ فِيْهَا خٰلِدُوْنَ [2: 39]۔ اگر تسخیر فطرت کرنے والی قوم کو \\\"آدم\\\" (محض آدمی) کہا جائے تو اشیائے فطرت کو قوانین خداوندی کے مطابق صرف کرنے والی قوم کو \\\"مومن\\\" کہا جائے گا۔ اور جو قوم نہ تسخیرِ فطرت کرے اور نہ ہی اتباع قوانین خداوندی تو اسے؟ کہتے ہوئے جھجک محسوس ہوتی ہے لیکن بہر حال کہنا ہی پڑتا ہے، کہ اسے دور حاضر کے مسلمان کہا جائے گا! یا للعجب۔\\r\\n \\\"آدم\\\" کے علم الاسماء کے ضمن میں ایک مغربی ڈاکٹر نے اپنے نقطہ نگاہ سے بڑی دلچسپ بات لکھی ہے۔ وہ کہتا ہے کہ\\r\\n  آدم پر تمام زندہ اشیاء کا نام رکھنے کی ذمہ داری عائد کی گئی۔یہ بہت بڑی ذمہ داری اور مشکل کام تھا۔ اس لیے کہ جن چیزوں کا نام نہیں رکھا جاتا ان کے خواص بھی غیر متعین رہ جاتے ہیں۔ اور جن چیزوں کے غلط نام رکھے جاتے ہیں، ان سے بڑے نقصان پہنچتے ہیں*\\r\\n(\\\"Dr. M.L.Tyler  in Homeo. \\\"Drug Pictures Preface)۔\\r\\n اس سے بھی مراد، کائنات کے علوم طبعی کی تحصیل ہے جو \\\"آدمیت\\\" کی علامت ہے۔ \\\"غلط نام\\\" رکھنے کے ضمن میں قرآن کریم نے کہا ہے کہ جنہیں تم (خدا کے علاوہ )اپنا معبود سمجھتے ہو وہ بجز ایں نیست کہ  اَسْمَاۗءً سَمَّيْتُمُوْهَآ اَنْتُمْ وَاٰبَاۗؤُكُمْ [40:12]۔ \\\"یونہی کچھ نام ہیں جو تم نے اور تمہارے آباء و اجداد نے رکھ لیے ہیں\\\"۔  مَّآ اَنْزَلَ اللّٰهُ بِهَا مِنْ سُلْطٰنٍ [40:12]۔\\\"الله نے ان کے لیے کوئی سند نازل نہیں کی\\\"۔ یہ جو ہمارے ہاں بھی بڑے بڑے آستانے اور درگاہیں سجدہ گاہ ِانام بن رہی ہیں، ان کی وجہ صرف یہ ہے کہ ان کے بڑے بڑے نام رکھ دئے گئے ہیں اور ان ناموں کو شہرت دے دی گئی ہے۔ اگر ان کے ایسے نام نہ رکھے جائیں تو وہ مٹی اور پتھر کی عمارتوں سے زیادہ کچھ حیثیت نہ رکھیں۔ حقیقت یہ ہے کہ کائنات میں ہر شے کا صحیح مقام وہی ہے جو اسے خدا کا قانون عطا کرے۔ کائناتی دنیا میں اس کا قانونِ کائنات، اور انسانی دنیا میں ضابطۂ  وحی (قرآن عظیم)۔ باقی سب بتانِ آزری ہیں۔\\r\\n\\r\\nب۔ حرف جر ہے۔ ذیل کی مثالوں سے اس کا استعمال اور مفہوم واضح ہو جائے گا\\r\\n1)  اردو میں کہتے ہیں \\\"میں نے زید کو پکڑا\\\" عربی میں کہیں گے۔ اَمْسَکْتُ بِزَیْدٍ قرآن کریم میں ہے۔فَامْسَحُوْا بِوُجُوْهِكُمْ[43:4]۔\\\" اپنے چہروں کو (پر) مسح کرلو\\\"۔</p>\\r\\n2)   اردو میں کہتے ہیں \\\"میں زید کے پاس سے گزرا\\\"۔ عربی میں کہیں گے۔ مَرَرْتُ بِزَیْدٍ۔قرآن کریم میں ہےِ اِذَا مَرُّوْا بِاللَّغْو[72:25]۔ \\\"جب وہ لغو کے پاس سے گزرتے ہیں\\\"۔\\r\\n(3)  فعل لازم کو متعدی بنانے کے لیے ۔مثلاً ذَہَبَ زَیْدٌ کے معنی ہیں زید گیا۔ یہ فعل لازم ہے۔ ذَہَبْتُ بِزَیْدٍ کے معنی ہوں گے۔ میں زید کے ساتھ گیا یعنی زید کو لے گیا۔ اس طرح یہ فعل لازم سے متعدی بن گیا۔ قرآن کریم میں ہے۔ ذَھَبَ اللّٰهُ بِنُوْرِهِمْ[17:2]۔ \\\"اﷲ ان کی روشنی کو لے گیا\\r\\n(4) سبب کو ظاہر کرتا ہے۔ مثلاًاِنَّكُمْ ظَلَمْتُمْ اَنْفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ[54:2]۔ \\\"تم نے بچھڑے کی پرستش کی وجہ سے اپنے آپ پر ظلم کیا ہے\\\"۔\\r\\n(5)   \\\"کے ساتھ\\\" کے معنوں میں۔ يٰنُوْحُ اهْبِطْ بِسَلٰمٍ مِّنَّا[48:11]۔ \\\"اے نوح! ہماری طرف سے سلامتی کے ساتھ اتر جا\\\"۔عَلَّمَ بِالْقَلَمِ[4:96]۔ \\\"اس نے قلم کے ذریعے سکھایا\\\"۔\\r\\n(6)  وقت یا جگہ بتانے کے لیے بمعنی فِیْ (میں)۔ مثلاً نَجَّيْنٰهُمْ بِسَحَرٍ[34:54]۔ \\\"ہم نے انہیں صبح کے وقت بچا لیا\\\"۔ اور  وَلَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ [122:3]۔ \\\"یقینا اﷲ نے بدر کے میدان میں تمہاری مدد کی ہے\\\"۔\\r\\n(7)   کسی چیز کے عوض\\\" اِشْتَرَیْتُہ‘ بِاَلْفِ دِرْہَمٍ۔ میں نے اسے ایک ہزار درہم کے عوض خریدا ہے۔ قرآن کریم میں ہے۔ وَشَرَوْهُ بِثَمَنٍۢ بَخْسٍ[20:12]۔ \\\"اور انہوں نے اسے (حضرت یوسف کو) تھوڑی سی قیمت کے ھوض بیچ ڈالا\\\"۔\\r\\n(8)   عَلٰی (اوپر) کے معنوں میں۔ لَوْتُسَوَّیٰ بِہِمُ الْاَرْضُ[42:4]۔ \\\"اگر (یا اے کاش) ان پر (ان کے اوپر) زمین ہموار کر دی جاتی\\\"*اس کا مجازی مفہوم کچھ اور بھی ہو سکتا ہے.دیکھئے عنوان  س۔و۔ی ۔\\r\\n(9)  عَنْ (سے) کے معنوں ميں۔ فَسْـَٔــلْ بِهٖ خَبِيْرًا[59:25] \\\"اس کے متعلق اس سے پوچھو جو خبر رکھتا ہے\\\"۔\\r\\n(10)  مِنْ (۪سے) کے معنوں میں۔ عَيْنًا يَّشْرَبُ بِهَا عِبَادُ اللّٰهِ[6:76] \\\"چشمہ جس سے اللہ کے بندے پیتے ہیں\\\"۔ بعض کا خیال ہے کہ جس طرح مِنْ تبعیض کے لیے آتا ہے۔ اسی طرح ب بھی تبعیض کے لیے آتا ہے۔ تبعیض کے معنی ہیں، کسی چیز کا بعض۔ یعنی کچھ حصہ، پورا نہیں، بلکہ اس کا بعض حصہ۔ چنانچہ اُن کا کہنا ہے کہ قرآن کریم میں جو آیا ہے۔ وَامْسَحُوْا بِرُءُوْسِكُمْ[6:5]۔ تو اس کے معنی ہیں \\\"سر کے کچھ حصہ کا مسح کر لیا کرو\\\"۔ لیکن یہ صرف بعض کا خیال ہے (مغنی اللبیب)۔\\r\\n(11)  بعض مقامات پر یہ حرف زائد ہوتا ہے۔ یعنی اس کے معنی کچھ نہیں ہوتے۔ جیسے كَفٰى بِاللّٰهِ شَهِيْدًا[13:43]۔ \\\"اﷲ کافی شاہد ہے\\\"۔ اگرکَفٰی اﷲُ شَہِیْداً کہیں تو بھی وہی معنی ہوں گے۔\\r\\n(12)  میرزا ابو الفضل نے (غریب القرآن میں) لکھا ہے کہ بِسْمِ اﷲِ میں ب کے معنی استعانت کے ہیں۔ یعنی مدد مطلب کرنے کے۔\\r\\n(13)   بِاﷲِ کے معنی ہیں اﷲ کی قسم۔ یعنی ب قسم کے معنوں میں بھی آتی ہے۔\\r\\n",
        "Meaning": "In (the) name\\r\\n ",
        "RootWord": " س م و ",
        "Sno": 1,
        "SooratId": 1,
        "SooratName": "سورة الفاتحة",
        "WordNo": 1
    }}
